app/controllers/users_controller.rb

  def index
    @users = Rails.cache.fetch('users_index') do
      User.all.as_json
---
SELECT "users".* FROM "users"